{
  "qualification": [
    "Must be at least 18 years of age",
    "Basic computer, math and tape measuring skills",
    "Daily overtime and weekend work as needed",
    "Must be able to stand and walk for long periods of time (8-10 hour shifts with appropriate breaks)",
    "Ability to lift up to 50 pounds on a regular basis (depending on position)",
    "Pass a pre-employment drug screen and physical assessment. Adhere to random drug screening."
  ],
  "job-listing": [
    {
      "title": "Continuous Improvement Engineer",
      "description": [
        "Responsible for evaluating new and existing processes and for improving those processes for insulated glass manufacturing; will be responsible for optimizing production process and reducing waste; use ERP systems, improving sustainability, and increasing productivity/effectiveness; will act as a continuous improvement leader/champion during improvement activities and provide lean best practice training as needed; produce executive summaries and present improvement event report outs; use, evaluate and improve equipment hardware such as additive manufacturing equipment, controller including microcontrollers,  or user interfaces that process glass, metals, sealants, argon/krypton gas, and desiccant, to reduce cost, cycle time or to improve quality; create and update SOPs and visuals for production personnel during improvement activities; use Solidworks/AutoCAD to create, edit fixturing and/or equipment designs; use VBA to create macros that automate or simplify the use of excel spreadsheets; provide data analysis and track production metrics by using Python, R Studio, and MS-SQL to identify opportunities for improvement; responsible for providing off shift and/or weekend coverage; design and produce prototypes, fixturing, gauges using 3D printers; and repair/maintain 3D printers."
      ],
      "specs": [
        "Master’s degree in Industrial Engineering, Mechanical Engineering, Electrical Engineering or Manufacturing Engineering and one year of experience in manufacturing, engineering, project management, or continuous improvement.",
        "Two years of experience using Solidworks, AutoCAD, VBA, Python and R Studio.",
        "One year of experience in the following: optimizing production processes and reducing waste evaluating, installing, troubleshooting microcontrollers using additive manufacturing equipment using ERP Systems",
        "Must possess Six Sigma Green Belt Certification."
      ]
    },
    {
      "title": "Production Technician - 12-Hour Shifts",
      "description": [
        "Work 3 days, 4 days Off. Full time 12 Hour shift position for entry level production workers. The primary duties include handling glass, lifting glass, inspecting glass for defects, slotting and packing glass in racks. Employees must work well in a team and be flexible and willing to perform a variety of jobs."
      ],
      "specs": [],
      "shifts": [
        "Sunday – Tuesday: 5:45pm – 6:15am",
        "Wednesday – Friday: 5:45pm – 6:15am"
      ],
      "link": "#"
    },
    {
      "title": "Production Technician - 2nd Shift",
      "description": [
        "Full time position for entry level production workers. The primary duties include handling glass, lifting glass, inspecting glass for defects, slotting and packing glass in racks. Employees must work well in a team and be flexible and willing to perform a variety of jobs."
      ],
      "specs": [],
      "shifts": [
        "2nd Shift: 2:45pm – 11:15pm"
      ],
      "link": "#"
    },
    {
      "title": "Production Technician - 3rd Shift",
      "description": [
        "Full time position for entry level production workers. The primary duties include handling glass, lifting glass, inspecting glass for defects, slotting and packing glass in racks. Employees must work well in a team and be flexible and willing to perform a variety of jobs."
      ],
      "specs": [],
      "shifts": [
        "3rd Shift: 10:45pm – 7:15am"
      ],
      "link": "#"
    },
    {
      "title": "Maintenance Technician - 2nd Shift",
      "description": [
        "Full time position involving maintaining, trouble shooting, and performing maintenance on all plant equipment in a highly automated manufacturing facility. Must be responsive, a team player, self-motivated and detail focused."
      ],
      "specs": [
        "2 year Associate Degree preferred or 2-5 years’ experience with similar job requirements.",
        "Starting pay depends on education and experience"
      ],
      "shifts": [
        "2nd Shift: 2:00pm – 10:00pm"
      ],
      "link": "#"
    },
    {
      "title": "Maintenance Technician - 3rd Shift",
      "description": [
        "Full time position involving maintaining, trouble shooting, and performing maintenance on all plant equipment in a highly automated manufacturing facility. Must be responsive, a team player, self-motivated and detail focused."
      ],
      "specs": [
        "2 year Associate Degree preferred or 2-5 years’ experience with similar job requirements.",
        "Starting pay depends on education and experience"
      ],
      "shifts": [
        "3rd Shift: 10:00pm – 6:00am"
      ],
      "link": "#"
    }
  ]
}